Repository: pikougi-nabot/epochrefs-old
Catalog: commit/84000/data-translation-memory/toh44-45_84000-the-stem-array.tmx/chapters-5-9.tmx
Source language: bo
Languages: en

source: ཚིག་གི་རྒྱུད་དེ་དག་གིས་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ལ་ཡོངས་སུ་བསྔགས་པ་བྱས་ནས། ཚོང་དཔོན་གྱི་བུ་ནོར་བཟངས་ལ་ལེགས་སོ་ཞེས་བསྔགས་སོ། །དེ་ལྟར་དེ་བྱང་ཆུབ་སེམས་དཔའ་ཡང་དག་པར་དགའ་བར་བྱ་བའི་ཕྱིར་ཚིག་བརྗོད་པའི་ཚེ། ཁའི་སྒོ་ནས་འོད་འཕྲོ་བའི་ཕུང་པོ་རྣམ་པ་འདི་ལྟ་བུ་བྱུང་སྟེ།
en: As he was proclaiming those words that brought delight to bodhisattvas, a mass of light rays was emitted from his mouth in this fashion:

source: འོད་འཕྲོ་བའི་ཕུང་པོ་དེས་སྟོང་གསུམ་གྱི་འཇིག་རྟེན་གྱི་ཁམས་རྒྱས་པར་གང་བར་གྱུར་ནས། ལྷ་དང་ལྷ་རྫུ་འཕྲུལ་ཆེན་པོའམ། ཀླུ་དང་ཀླུ་རྫུ་འཕྲུལ་ཆེན་པོ་འམ། གནོད་སྦྱིན་དང་གནོད་སྦྱིན་རྫུ་འཕྲུལ་ཆེན་པོའམ། དྲི་ཟ་དང་དྲི་ཟ་རྫུ་འཕྲུལ་ཆེན་པོའམ། ལྷ་མ་ཡིན་དང་ལྷ་མ་ཡིན་རྫུ་འཕྲུལ་ཆེན་པོའམ། ནམ་མཁའ་ལྡིང་དང་ནམ་མཁའ་ལྡིང་རྫུ་འཕྲུལ་ཆེན་པོའམ། མིའམ་ཅི་དང་མིའམ་ཅི་རྫུ་འཕྲུལ་ཆེན་པོའམ། ལྟོ་འཕྱེ་ཆེན་པོ་དང་ལྟོ་འཕྱེ་ཆེན་པོ་རྫུ་འཕྲུལ་ཆེན་པོའམ།
en: that mass of light rays spread throughout the billion worlds.

source: མི་དང་མི་རྫུ་འཕྲུལ་ཆེན་པོའམ། མི་མ་ཡིན་པ་དང་མི་མ་ཡིན་པ་རྫུ་འཕྲུལ་ཆེན་པོའམ། ཚངས་པ་དང་ཚངས་པ་རྫུ་འཕྲུལ་ཆེན་པོའམ། སེམས་ཅན་གང་སུས་མཐོང་ཡང་རུང་སྟེ། སྣང་བ་དེས་ཡོངས་སུ་སྣང་བར་བྱས་པ་དེ་དག་དྲ་བྱི་ལ་སྤྲིན་གྱི་དྲུང་དུ་འོངས་སོ།
en: Those beings who saw it and were illuminated by that great radiance—devas and devas with great miraculous power, nāgas and nāgas with great miraculous power, yakṣas and yakṣas with great miraculous power, gandharvas and gandharvas with great miraculous power, asuras and asuras with great miraculous power, garuḍas and garuḍas with great miraculous power, kinnaras and kinnaras with great miraculous power, mahoragas and mahoragas with great miraculous power, humans and humans with great miraculous power, nonhumans and nonhumans with great miraculous power, Brahmakāyikas and Brahmakāyikas with great miraculous power—came into the presence of Megha the Dravidian.

source: །དེ་ནས་དེ་ལྟར་དྲ་བྱི་ལ་སྤྲིན་གྱིས་བསམ་པ་བྱིན་གྱིས་བརླབས་ཤིང་ཐལ་མོ་སྦྱར་ཏེ།
en: Their thoughts were thus blessed by Megha the Dravidian, and they placed their palms together in homage.

source: གནས་པ་ལུས་དང་སེམས་སིམ་པར་གྱུར་པ། དགའ་བ་རྒྱ་ཆེན་པོ་སྐྱེས་པ། སྲི་ཞུ་ཆེན་པོ་ལ་གནས་པ། ང་རྒྱལ་གྱི་རྒྱལ་མཚན་བཅོམ་པ། གཡོ་རྒྱུ་དང་བྲལ་བ།
en: Their bodies and minds were refreshed, they felt vast joy, they showed great veneration, they had cast down the banner of pride, they were free of deceit, and their senses were serene.

source: དབང་པོ་རྣམ་པར་དང་བར་གྱུར་པ་དེ་དག་ལ་དྲ་བྱི་ལའི་སྤྲིན་གྱིས་ཆོས་ཀྱི་རྣམ་གྲངས་ཡི་གེའི་འཁོར་ལོའི་རྒྱུད་ཀྱི་རྒྱན་ཅེས་བྱ་བ་དེ་ཉིད་རྒྱ་ཆེར་ཡང་དག་པར་བསྟན་ཏེ།
en: Megha the Dravidian taught them extensively the Dharma teaching called The Display of the Rotating Wheel of Syllables

source: ཁོང་དུ་ཆུད་པ་དང་རྟོགས་པ་དང་ཤེས་པ་དང་རིག་པར་བྱས་སོ། །དེ་ཐོས་ནས་ཀྱང་དེ་དག་ཐམས་ཅད་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ལས་ཕྱིར་མི་ལྡོག་པར་གྱུར་ཏོ། །དེ་ནས་དེའི་ཕྱིར་ཆོས་ཀྱི་སྟན་ལ་འདུག་ནས།
en: He made it known to them, introduced them to it, led them into it, and caused them to understand it. Having heard it, they all gained irreversible progress toward the highest, complete enlightenment.

source: ཚོང་དཔོན་གྱི་བུ་ནོར་བཟངས་ལ་འདི་སྐད་ཅེས་སྨྲས་སོ། །རིགས་ཀྱི་བུ་ཁོ་བོ་ནི་དབྱངས་དང་ལྡན་པའི་གཟུངས་ཐོབ་པ་སྟེ།
en: Then Megha the Dravidian sat again upon the Dharma throne and said to Sudhana, the head merchant’s son, “Noble one, I have attained Sarasvatī’s power of retention.

source: དེའི་མཐུས་ཁོ་བོ་སྟོང་གསུམ་གྱི་སྟོང་ཆེན་པོའི་འཇིག་རྟེན་གྱི་ཁམས་འདི་ལྷ་རྣམས་ཀྱི་ལྷའི་སྐད་ཀྱང་ཤེས་སོ།
en: Through its power I know the divine languages of the devas in these world realms of the billion-world universe.

source: །དེ་བཞིན་དུ་ཀླུ་དང་གནོད་སྦྱིན་དང་། དྲི་ཟ་དང་། ལྷ་མ་ཡིན་དང་ནམ་མཁའ་ལྡིང་དང་མིའམ་ཅི་དང་། ལྟོ་འཕྱེ་ཆེན་པོ་དང་། མི་དང་མི་མ་ཡིན་པ་དང་། ཚངས་པ་རྣམས་ཀྱི་ཚངས་པའི་སྐད་ཀྱང་ཤེས་སོ།
en: In the same way, I know the languages of the nāgas, yakṣas, gandharvas, asuras, garuḍas, kinnaras, mahoragas, humans, and nonhumans and the Brahmakāyika language of the Brahmakāyika devas.

source: །ལྷ་རྣམས་ཀྱི་ལྷའི་སྐད་སྣ་ཚོགས་ཀྱང་ཤེས་སོ། །དེ་བཞིན་དུ་ཀླུ་དང་གནོད་སྦྱིན་དང་དྲི་ཟ་དང་། ལྷ་མ་ཡིན་དང་ནམ་མཁའ་ལྡིང་དང་མིའམ་ཅི་དང་། ལྟོ་འཕྱེ་ཆེན་པོ་དང་། མི་དང་མི་མ་ཡིན་པ་དང་། ཚངས་པ་རྣམས་ཀྱི་ཚངས་པའི་སྐད་སྣ་ཚོགས་ཀྱང་ཤེས་སོ། །ལྷ་རྣམས་ཀྱི་ལྷའི་སྐད་གཅིག་པ་ཡང་ཤེས་སོ། །དེ་བཞིན་དུ་ཀླུ་དང་གནོད་སྦྱིན་དང་དྲི་ཟ་དང་། ལྷ་མ་ཡིན་དང་ནམ་མཁའ་ལྡིང་དང་མིའམ་ཅི་དང་། ལྟོ་འཕྱེ་ཆེན་པོ་དང་། མི་དང་མི་མ་ཡིན་པ་དང་། ཚངས་པ་རྣམས་ཀྱི་ཚངས་པའི་སྐད་གཅིག་པ་ཡང་ཤེས་སོ།
en: “I know the various divine languages of the devas, and similarly I know the various languages of the nāgas, yakṣas, gandharvas, asuras, garuḍas, kinnaras, mahoragas, humans, and nonhumans and the various Brahmakāyika languages of the Brahmakāyika devas.

source: །ལྷ་རྣམས་ཀྱི་ལྷའི་སྐད་ཐ་དད་པ་ཡང་ཤེས་སོ། །དེ་བཞིན་དུ་ཀླུ་དང་གནོད་སྦྱིན་དང་དྲི་ཟ་དང་ལྷ་མ་ཡིན་དང་། ནམ་མཁའ་ལྡིང་དང་མིའམ་ཅི་དང་། ལྟོ་འཕྱེ་ཆེན་པོ་དང་མི་དང་མི་མ་ཡིན་པ་དང་། ཚངས་པ་རྣམས་ཀྱི་ཚངས་པའི་སྐད་ཐ་དད་པ་ཡང་ཤེས་སོ།
en: “I know the different divine languages of the devas, and similarly I know the different languages of the nāgas, yakṣas, gandharvas, asuras, garuḍas, kinnaras, mahoragas, humans, and nonhumans and the different Brahmakāyika languages of the Brahmakāyika devas.

source: །བྱོལ་སོང་གི་སྐྱེ་གནས་སུ་སྐྱེས་པའི་སེམས་ཅན་རྣམས་ཀྱི་བརྡ་དང་སྐད་དང་མིང་ཐ་དད་པའང་ཤེས་སོ།
en: “I also know the different signs , languages, and names of the beings who have been reborn as animals.

source: །སེམས་ཅན་དམྱལ་བ་པའི་སེམས་ཅན་རྣམས་ཀྱི་སྐད་དང་། མིང་རྣམས་ཀྱང་ཤེས་སོ།
en: I also know the different languages and names of the beings who have been reborn in the hells.

source: །གཤིན་རྗེའི་འཇིག་རྟེན་པའི་སེམས་ཅན་རྣམས་ཀྱི་སྐད་དང་མིང་རྣམས་ཀྱང་ཤེས་སོ། །འཕགས་པའི་སྐད་དང་མིང་རྣམས་ཀྱང་ཤེས་སོ།
en: I also know the different languages and names of the beings in the realm of Yama. I also know the languages and names of the āryas.

source: །འཕགས་པ་མ་ཡིན་པའི་སྐད་དང་མིང་རྣམས་ཤེས་སོ།
en: I also know the languages and names of those who are not āryas.

source: །བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་ཚིག་དང་བརྡ་དང་། ངེས་པའི་ངག་སེམས་ཅན་གྱི་བསམ་པ་བཞིན་དུ་འབྱུང་བ་ཡང་ཤེས་སོ།
en: I also know the words, signs , and definitions of bodhisattvas that arise in accordance with the wishes of beings.

source: །སེམས་ཀྱི་སྐད་ཅིག་རེ་རེ་ལ་ཡང་དུས་གསུམ་དུ་གཤེགས་པའི་དེ་བཞིན་གཤེགས་པ་རྣམས་ཀྱི་དབྱངས་ཀྱི་ཡན་ལག་དང་གསུང་རྒྱ་མཚོ་སེམས་ཅན་ཐམས་ཅད་ཀྱི་མིང་དང་གཏམ་གྱི་སྒྲ་དང་། ཚིག་ཏུ་ལྡན་པ་ཡང་རྟོགས་ཤིང་ཁོང་དུ་ཆུད་དོ། །ཇི་ལྟར་སྟོང་གསུམ་གྱི་སྟོང་ཆེན་པོའི་འཇིག་རྟེན་གྱི་ཁམས་འདིའི་སེམས་ཅན་རྣམས་ཀྱི་བརྡ་དང་ངེས་པའི་ཚིག་དང་སྐད་དང་མིང་རྒྱ་མཚོ་ལ་འཇུག་ཅིང་ཤེས་པ་དེ་བཞིན་དུ་ཤར་ཕྱོགས་ཀྱི་འཇིག་རྟེན་གྱི་ཁམས་བྱེ་བ་ཁྲག་ཁྲིག་བརྒྱ་སྟོང་ཚད་མེད་པ། གྲངས་མེད་པ།
en: “In each instant of mind, I perceive and comprehend the aspects of the voices and the oceans of speech of all the tathāgatas in the three times, and the words, the sound of conversations, and the languages that are used by all beings.

source: བསམ་གྱིས་མི་ཁྱབ་པ། མཚུངས་པ་མེད་པ། ཀུན་ཏུ་མཐའ་ཡས་པ་མུ་མེད་པ། ས་མཚམས་མེད་པ་གཞལ་དུ་མེད་པ། བརྗོད་དུ་མེད་པའི་ཡང་བརྗོད་དུ་མེད་པ་དང་། དེ་བཞིན་དུ་ལྷོ་ཕྱོགས་དང་། ནུབ་ཕྱོགས་དང་བྱང་ཕྱོགས་དང་། བྱང་ཤར་གྱི་ཕྱོགས་མཚམས་དང་། ཤར་ལྷོའི་ཕྱོགས་མཚམས་དང་། ལྷོ་ནུབ་ཀྱི་ཕྱོགས་མཚམས་དང་། ནུབ་བྱང་གི་ཕྱོགས་མཚམས་དང་། འོག་དང་སྟེང་གི་ཕྱོགས་ཀྱི་འཇིག་རྟེན་གྱི་ཁམས་བྱེ་བ་ཁྲག་ཁྲིག་བརྒྱ་སྟོང་ཚད་མེད་པ་ནས་བརྗོད་དུ་མེད་པའི་ཡང་བརྗོད་དུ་མེད་པའི་བར་གྱི་སེམས་ཅན་རྣམས་ཀྱི་བརྡ་དང་། ངེས་པའི་ཚིག་དང་སྐད་དང་མིང་རྒྱ་མཚོ་ཐམས་ཅད་ལ་འཇུག་ཅིང་ཤེས་ཏེ།
en: “Just as I perceive and know the ocean of terms, definitions, languages, and names of beings in this world realm of a billion worlds, in the same way, I perceive and know the ocean of terms, definitions, languages, and names of beings in a quintillion world realms, a measureless number of world realms, innumerable world realms, an inconceivable number of world realms, an unequaled number of world realms, an infinite number of world realms, limitless world realms, and an inexpressible number of world realms in the eastern direction, and it is the same for the south, the west, the north, the northeast, the southeast, the southwest, the northwest, below, and above.

source: འདི་ལྟར་ལྷ་རྣམས་ཀྱི་ལྷའི་སྐད་ཀྱང་ཤེས་སོ། །ཚངས་པ་རྣམས་ཀྱི་ཚངས་པའི་སྐད་ཀྱི་བར་དུའང་ཤེས་སོ།
en: “In that way, I know the deva language of the devas, and so on, up to knowing the Brahmakāyika language of the Brahmakāyika devas.

source: །རིགས་ཀྱི་བུ་ཁོ་བོས་ནི་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་གཟུངས་སྣང་བ་དབྱངས་དང་ལྡན་པ་འདི་ཤེས་པར་ཟད་ན། ཁོ་བོས་བྱང་ཆུབ་སེམས་དཔའ་འགྲོ་བ་སྣ་ཚོགས་ཀྱི་བརྡའི་རྣམ་པ་རྒྱ་མཚོ་ལ་ཞུགས་པ་དེ་དག་དང་། འགྲོ་བ་སྣ་ཚོགས་ཀྱི་སྐད་དང་། མིང་རྒྱ་མཚོ་ལ་ཞུགས་པ་དེ་དག་དང་། འགྲོ་བ་སྣ་ཚོགས་ཀྱི་མིང་ཤིན་ཏུ་བསྟན་པ་མིང་རྒྱ་མཚོ་ལ་ཞུགས་པ་དེ་དག་དང་འགྲོ་བ་སྣ་ཚོགས་ཀྱི་བརྗོད་པ་རབ་ཏུ་བཀོད་པ་དང་། རྣམ་པར་སྤྱོད་པ་རྒྱ་མཚོ་ལ་ཞུགས་པ་དེ་དག་དང་། ཚིག་ཐམས་ཅད་ཀྱི་མཚམས་སྦྱར་བ་རྒྱ་མཚོ་ལ་ཞུགས་པ་དེ་དག་དང་། ཚིག་ལྷུར་བླངས་ཏེ་བསྟན་པ་རྒྱ་མཚོ་ལ་ཞུགས་པ་དེ་དག་དང་། དུས་གསུམ་གྱི་དམིགས་པ་ཐམས་ཅད་དམིགས་པ་གཅིག་ཏུ་རྣམ་པར་སྤྱོད་པ་རྒྱ་མཚོ་གང་ཆེན་མཚོ་ལ་ཞུགས་པ་དེ་དག་དང་། ཚིག་གིས་བརྩེགས་ཏེ་བསྟན་པ་རྒྱ་མཚོ་ལ་ཞུགས་པ་དེ་དག་དང་། ཚིག་གཉིས་ནས་བརྩེགས་ཏེ་བསྟན་པ་རྒྱ་མཚོ་ལ་ཞུགས་པ་དེ་དག་དང་། ཚིག་རབ་ཏུ་ཕྱེ་སྟེ་བསྟན་པ་རྒྱ་མཚོ་ལ་ཞུགས་པ་དེ་དག་དང་། ཆོས་ཐམས་ཅད་རབ་ཏུ་དབྱེ་བས་འདུལ་བའི་ཚུལ་བསྟན་པ་རྒྱ་མཚོ་ལ་ཞུགས་པ་དེ་དག་དང་། འགྲོ་བ་ཐམས་ཅད་ཀྱི་སྐད་རྒྱ་མཚོ་ལ་ཞུགས་པ་དེ་དག་དང་། དབྱངས་ཀྱི་དཀྱིལ་འཁོར་རྣམ་པར་དག་པའི་རྒྱན་ཐམས་ཅད་ལ་ཞུགས་པ་དེ་དག་དང་། ཡི་གེའི་འཁོར་ལོའི་མཐར་ཕྱིན་པར་བྱ་བས་རབ་ཏུ་དབྱེ་བ་ལས་བྱུང་བ་དེ་དག་གི་སྤྱོད་པ་ཤེས་པའམ། ཡོན་ཏན་བརྗོད་པར་ནུས་རེ་སྐན།
en: “Noble one, I know the light of Sarasvatī’s power of retention that the bodhisattvas have, but how could I know the conduct or describe the qualities of the entry by the bodhisattvas into an ocean of different terms, their entry into an ocean of terms and languages of various beings, their entry into an ocean of taught names of various beings, their entry into an ocean of an array of descriptions by various beings, their entry into an ocean of conducts, their entry into an ocean of the conjunctions of all words, their entry into an ocean of the literal meaning of words, their entry into an ocean of single terms for perceptions that include all perceptions in the three times, their entry into an ocean of teaching through assembling a single word, their entry into an ocean of teaching through assembling two words, their entry into an ocean of teaching through dividing words, their entry into an ocean of teaching that brings guidance through categorizing the words for all phenomena, their entry into an ocean of the languages of all beings, their entry in the entire pure display of the field of speech, and what arises in the categories of the apex of the wheel of words? “Now depart, noble one.

source: །སོང་རིགས་ཀྱི་བུ་ལྷོ་ཕྱོགས་ཀྱི་རྒྱུད་འདི་ཉིད་ན་ཡུལ་ནགས་ཚལ་ན་གནས་པ་ཞེས་བྱ་བ་ཡོད་དེ།
en: In this southern region, in the land of Vanavāsī, there dwells a head merchant by the name of Muktaka.

source: དེ་ན་ཚོང་དཔོན་བཏང་བརྗོད་ཅེས་བྱ་བ་འདུག་གི་དེའི་གན་དུ་སོང་ལ་ཇི་ལྟར་བྱང་ཆུབ་སེམས་དཔས་བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པ་ལ་བརྩོན་པར་བྱ་བ་དང་། ཇི་ལྟར་འབྱུང་བར་བྱ་བ་དང་། ཇི་ལྟར་སེམས་ངེས་པར་བཞག་པར་བྱ་བ་དྲིས་ཤིག །དེ་ནས་ཚོང་དཔོན་གྱི་བུ་ནོར་བཟངས་ཀྱིས།
en: Go to him and ask him, ‘How should bodhisattvas train in bodhisattva conduct? How should they set forth? How should their minds rest in meditation?’

source: དྲ་བྱི་ལ་སྤྲིན་གྱི་རྐང་པ་གཉིས་ལ་སྤྱི་བོས་ཕྱག་འཚལ་ཏེ། ཆོས་ཀྱི་རིམ་གྲོ་བྱས་ནས། དད་པའི་མཚན་ཉིད་རྩ་བ་ཚུགས་པ་ལ་རབ་ཏུ་བརྟག་པ་དང་། དགེ་བའི་བཤེས་གཉེན་ལས་འོངས་པའི་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ལ་ཡང་དག་པར་ལྟ་ཞིང་གདོང་མཆི་མས་གང་བར་ངུས་ཏེ། དྲ་བྱི་ལ་སྤྲིན་ལ་ལན་བརྒྱ་སྟོང་དུ་མར་གཡས་ཕྱོགས་སུ་བསྐོར་བ་བྱས་ནས། ཡང་དང་ཡང་བལྟས་ཏེ་ཕྱག་འཚལ་ཞིང་དྲ་བྱི་ལ་སྤྲིན་གྱི་དྲུང་ནས་སོང་ངོ་།།
en: Then Sudhana, the head merchant’s son, bowed his head to the feet of Megha the Dravidian, and showing respect for his Dharma, showing that Megha was the source for the signs of the arising of his faith, and seeing the omniscience that has come from the kalyāṇamitra, weeping, with his face covered in tears, he circumambulated Megha the Dravidian a hundred thousand times, keeping him to his right, and, looking back a hundred thousand times, departed from Megha the Dravidian. Muktaka

source: །།སངས་རྒྱས་རྨད་གཅད་ཅེས་བྱ་བ་ཤིན་ཏུ་རྒྱས་པ་ཆེན་པོའི་མདོ། བམ་པོ་ཉི་ཤུ་དགུ་པ། དེ་ནས་ཚོང་དཔོན་གྱི་བུ་ནོར་བཟངས་བྱང་ཆུབ་སེམས་དཔའི་གཟུངས་སྣང་བ་དབྱངས་དང་ལྡན་པའི་རྒྱན་དེ་ཉིད་ལ་རྗེས་སུ་བསམ་པ་དང་། བྱང་ཆུབ་སེམས་དཔའི་སྐད་ཀྱི་ཚུལ་རྒྱ་མཚོ་དེ་ཉིད་ལ་འཇུག་པར་བྱ་བ་དང་། བྱང་ཆུབ་སེམས་དཔའི་ཚུལ་ཕྲ་མོ་ལ་འཇུག་པ་དེ་ཉིད་རྗེས་སུ་དྲན་པར་བྱ་བ་དང་། བྱང་ཆུབ་སེམས་དཔའི་སེམས་རྣམ་པར་བྱང་བས། རྣམ་པར་དག་པ་དེ་ཉིད་ཀྱི་རྗེས་སུ་འབྲང་བར་བྱ་བ་དང་། བྱང་ཆུབ་སེམས་དཔའི་དགེ་བའི་རྩ་བའི་བག་ཆགས་བསྡུ་ཞིང་བསྒྲུབ་པ་མངོན་པར་བསྒྲུབ་པ་དང་། བྱང་ཆུབ་སེམས་དཔའི་ཡོངས་སུ་སྨིན་པར་བྱ་བའི་སྒོ་དེ་ཉིད་རྣམ་པར་སྦྱང་བ་དང་། བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་སེམས་ཅན་བསྡུ་བའི་ཡེ་ཤེས་དེ་ཉིད་ཤིན་ཏུ་བྱང་བར་བྱ་བ་དང་། བྱང་ཆུབ་སེམས་དཔའི་བསམ་པའི་སྟོབས་རྣམ་པར་དག་པ་བྱ་བ་དེ་ཉིད་བརྟན་པར་བྱ་བ་དང་། བྱང་ཆུབ་སེམས་དཔའི་ལྷག་པའི་བསམ་པའི་སྟོབས་དེ་ཉིད་ཉེ་བར་བརྟན་པར་བྱ་བ་དང་། བྱང་ཆུབ་སེམས་དཔའི་མོས་པའི་རྒྱུད་དེ་ཉིད་ཡོངས་སུ་སྦྱང་བ་དང་། བྱང་ཆུབ་སེམས་དཔའི་སེམས་དེ་ཉིད་གདོན་མི་ཟ་བར་དགེ་བར་བསམ་པ་དང་བྱང་ཆུབ་སེམས་དཔའི་ཡི་དམ་ཆེན་པོ་དེ་ཉིད་མཐར་ཕྱིན་པར་བྱེད་ཅིང་།
en: Sudhana, the head merchant’s son, then contemplated that power of retention of the bodhisattvas called the light that is the display of Sarasvatī , remembered that particular entry by the bodhisattvas into an ocean of languages, remembered that particular entry by the bodhisattvas into the way of subtlety, remembered that particular purity of the bodhisattvas through purification of the mind, accomplished that particular accomplishment by the bodhisattvas of creating the predispositions for roots of merit, purified that particular bodhisattva gateway for ripening, refined that particular bodhisattva wisdom that attracts beings, made firmer that particular pure strength of bodhisattva motivation, stabilized that particular strength of the superior motivation of the bodhisattvas, purified that lineage of bodhisattva aspiration, developed that particular goodness that is in the minds of the bodhisattvas, and entered into that particular commitment of the bodhisattvas.

source: ཚོང་དཔོན་གྱི་བུ་ནོར་བཟངས་ཡི་དམ་ལ་བརྟན་ཞིང་སྨོན་ལམ་གྱི་སེམས་ཀྱིས་ཡོངས་སུ་སྐྱོ་བ་མེད་པའི་རྒྱུད་ཀྱི་རྒྱན་དང་ལྡན་པ།
en: Sudhana, the head merchant’s son, displayed a continuity of strong commitment, a mind of aspiration, and indefatigability.

source: ཕྱིར་མི་ལྡོག་པས་རྣམ་པར་གནོན་པའི་བརྩོན་འགྲུས་ཅན།
en: He had the heroism of irreversible courage.

source: ཡིད་ཀྱིས་བརྟུལ་བ་ལས་མི་ཟློགས་པ།
en: He had the commitment of an irreversible mind.

source: དད་པ་མི་འཕྲོགས་པའི་སྟོབས་དང་ལྡན་པ།
en: He possessed the strength of unassailable faith.

source: རྡོ་རྗེ་མཐུ་བོ་ཆེ་མི་ཕྱེད་པའི་སེམས་དང་ལྡན་པ་དགེ་བའི་བཤེས་གཉེན་ཐམས་ཅད་ཀྱི་གདམས་ངག་འཐུན་པར་ལེན་པ།
en: His motivation had the indestructibility of the mighty vajra. He had acquired with reverence the instructions of all kalyāṇamitras.

source: ཤེས་རབ་ཁ་མ་བབ་པའི་ཡུལ་དང་ལྡན་པ།
en: He had an unimpaired scope of wisdom.

source: སྒོ་ཀུན་ནས་རྣམ་པར་དག་པ་ལ་མངོན་དུ་གྱུར་པ།
en: He faced the completely pure gateways.

source: ཡེ་ཤེས་རྣམ་པར་དག་པའི་སྤྱོད་ཡུལ་ཐོགས་པ་མེད་པ་ཀུན་ཏུ་ལྟ་བའི་ཡེ་ཤེས་ཀྱི་ཚུལ་སྣང་བ་དང་ལྡན་པ།
en: He possessed the unimpeded field of pure wisdom. He had the illumination of all-seeing wisdom.

source: སའི་གཟུངས་ཀུན་ནས་སྣང་བ་རབ་ཏུ་ཐོབ་པ།
en: He had attained the radiance of the retentive power of all levels.

source: ཆོས་ཀྱི་དབྱིངས་ཀྱི་གཞིའི་བྱེ་བྲག་ལ་མངོན་སུམ་དུ་གྱུར་པའི་སེམས་དང་ལྡན་པ།
en: His mind faced the separate bases of the realm of phenomena.

source: གཞི་ཀུན་ལ་རྟེན་པའི་རྒྱན་རྣམ་པར་དག་པའི་རང་བཞིན་རྣམ་པར་དམིགས་པ་གནས་པ་མེད་པ་དང་། བདག་གི་མེད་པ་དང་གཉིས་སུ་མེད་པའི་སྤྱོད་ཡུལ་ལ་རབ་ཏུ་བརྩོན་པ།
en: He perceived the nature of the pure display that is completely without any basis. He was devoted to the unattached, unequaled, nondual field of activity.

source: འདུ་ཤེས་ཐམས་ཅད་ལས་འདའ་བར་བྱེད་པའི་ཡེ་ཤེས་ཀྱི་སྒོ་རྣམ་པར་དག་པ།
en: He had the pure gateway of wisdom that surpasses all concepts.

source: ཆོས་ཀྱི་ཕྱོགས་དང་གཞི་ཐ་དད་པའི་ཕྱོགས་ལ་སོ་སོར་རྟོག་པ་མེད་པ་འཇིག་རྟེན་གྱི་གཞི་དང་ཕྱོགས་ཀྱི་བྱེ་བྲག་ལས་ཕྱིར་མི་ལྡོག་པ།
en: He had the discrimination of all the separate directions and families. He had not annulled the separate bases and directions of the world.

source: ཆོས་ཀྱི་གཞི་དང་ཕྱོགས་ཀྱི་བྱེ་བྲག་ལས་ཕྱིར་མི་ལྡོག་པ་སངས་རྒྱས་ཀྱི་ཕྱོགས་དང་གཞི་ཐ་དད་པ་མཐོང་བ་དང་། རྣམ་པར་རིག་པར་བྱ་བ་ལ་གཞོལ་བ།
en: He had not annulled the separate bases and directions of the Dharma. He was dedicated to the perception of the vision of the different directions and families of the buddhas.

source: དུས་ཀྱི་ཕྱོགས་དང་གཞིའི་བྱེ་བྲག་ཁོང་དུ་ཆུད་པའི་ཡེ་ཤེས་ཅན།
en: He had the wisdom that comprehended the different directions and bases of time.

source: ཆོས་ཀྱི་འཁོར་ལོ་ཡིད་དུ་འོང་བས་ཡང་དག་པར་བསྒྲུབས་པའི་བློ་དང་། ཡེ་ཤེས་ཀུན་ནས་སྣང་བའི་ཏིང་ངེ་འཛིན་གྱི་རྣམ་པར་སྣང་བས་སེམས་གསལ་བར་བྱས་པ།
en: He had the understanding endowed with the radiance of the wheel of the Dharma. The light of the complete radiance of wisdom and samādhi illuminated his mind.

source: ཡིད་ཀྱི་ཡུལ་ལུས་ཀུན་དང་ལྡན་པའི་ས་ལ་ཞུགས་པ་དེ་བཞིན་གཤེགས་པའི་ཡེ་ཤེས་སྣང་བས་རྒྱུད་ཤིན་ཏུ་སྣང་བར་བྱས་པ།
en: He had the mind and body that had reached the complete levels and ranges. He was continuously illuminated by the radiance of the wisdom of the tathāgatas.

source: ཐམས་ཅད་མཁྱེན་པ་ཉིད་དུ་དད་པའི་དཔའ་རླབས་ཀྱི་ཤུགས་ཀྱིས་རབ་ཏུ་རློབ་པ།
en: He had given rise to the power of faith in omniscience.

source: སངས་རྒྱས་ཀྱི་ཆོས་ལ་མོས་པའི་ཤུགས་དང་འབྲལ་བ་མེད་པ་དེ་བཞིན་གཤེགས་པའི་བྱིན་གྱི་རླབས་ཀྱིས་བྱིན་དུ་བརླབས་པ།
en: He was never lacking in the power of faith in the Buddhadharma. He possessed the blessing of the tathāgatas.

source: སངས་རྒྱས་ཐམས་ཅད་རང་གི་སེམས་ཀྱི་རྒྱུད་ཁོང་དུ་ཆུད་པའི་འོད་ཀྱིས་སྣང་བར་གྱུར་པ།
en: He had been illuminated by the light of the approach of his own mind to the buddhas.

source: འཇིག་རྟེན་གྱི་ཁམས་ཀྱི་དྲ་བ་ཐམས་ཅད་རང་གི་ལུས་ཀྱིས་རྒྱས་པར་དགང་བའི་སྨོན་ལམ་དང་ཆོས་ཀྱི་དབྱིངས་ཐམས་ཅད་རང་གི་ལུས་སུ་ཡང་དག་པར་བསྡུ་བ་དང་། མངོན་པར་བསྒྲུབ་པ་ལ་བརྩོན་པ།
en: He was endowed with the aspiration for his own body pervading the network of all world realms. He was dedicated to accomplishing the inclusion of the entire realm of phenomena within his own body.

source: དེ་མཐར་གྱིས་སོང་སོང་སྟེ། ལོ་བཅུ་གཉིས་ཀྱིས་ཡུལ་ནགས་ཚལ་ན་གནས་པར་ཕྱིན་ནས།
en: After twelve years he eventually arrived at Vanavāsī.

source: དེས་ཚོང་དཔོན་བཏང་བརྗོད་དེ་བཙལ་བཙལ་ཏེ་མཐོང་ངོ་།
en: He searched for the head merchant Muktaka and saw him.

source: །མཐོང་ནས་ཀྱང་ལུས་ཐམས་ཅད་ཀྱིས་ཕབ་སྟེ། ཕྱག་འཚལ་ནས་མདུན་དུ་འདུག་སྟེ།
en: When he saw him, he bowed down his entire body onto the ground in homage and sat before him.

source: ཐལ་མོ་སྦྱར་ནས་འདི་སྐད་ཅེས་སྨྲས་སོ།
en: With palms together he said, “Ārya, today I have succeeded;

source: །འཕགས་པ་བདག་དེ་རིང་དགེ་བའི་བཤེས་གཉེན་དང་མཇལ་བར་གྱུར་པ་ནི་བདག་གིས་འཐོབ་པར་བགྱི་བ་ལེགས་པར་ཐོབ་བོ།
en: I have succeeded well.

source: །དེ་ཅིའི་སླད་དུ་ཞེ་ན།
en: Why is that?

source: དགེ་བའི་བཤེས་གཉེན་རྣམས་ནི་མཐོང་བར་དཀའ་བའོ།
en: Because I have met the kalyāṇamitra. It is rare to have the opportunity to see the kalyāṇamitras.

source: །འབྱུང་བར་དཀའ་བའོ། །མཇལ་བར་དཀའ་བའོ།
en: It is rare to have the opportunity find their appearance.

source: །བགྲོད་པར་དཀའ་བའོ།
en: It is rare to have the opportunity arrive where they are.

source: །བསྙེན་བཀུར་བགྱི་བར་དཀའ་བའོ། །མཉེས་པར་བགྱི་བར་དཀའ་བའོ། །འགྲོགས་པར་དཀའ་བའོ། །རིམ་གྲོ་བགྱི་བར་དཀའ་བའོ། །དགེ་བའི་བཤེས་གཉེན་རྣམས་ནི་རྗེས་སུ་འབྲང་བར་དཀའ་བ་ལགས་ན།
en: It is rare to have the opportunity to go to where they are, it is rare to have the opportunity to serve them, it is rare to have the opportunity to approach them, it is rare to have the opportunity to dwell with them, it is rare to have the opportunity to train with them, and it is rare to have the opportunity to follow the kalyāṇamitras.

source: དེ་ལྟ་བུའི་དགེ་བའི་བཤེས་གཉེན་དང་འགྲོགས་པ་དེ་རིང་བདག་གིས་ཐོབ་པར་གྱུར་ཏོ། །འཕགས་པ་བདག་གིས་འདི་ལྟ་སྟེ།
en: “Today I have succeeded in being with the kalyāṇamitra. Ārya, I have developed the aspiration for the highest, complete enlightenment in order to serve all the buddhas;

source: སངས་རྒྱས་ཐམས་ཅད་བསྙེན་བཀུར་བ་དང་། སངས་རྒྱས་ཐམས་ཅད་ལ་རིམ་གྲོ་བགྱི་བ་དང་། སངས་རྒྱས་ཐམས་ཅད་ཀྱི་ཞལ་བལྟ་བ་དང་། སངས་རྒྱས་ཐམས་ཅད་རྣམ་པར་དམིགས་པར་བགྱི་བ་དང་། སངས་རྒྱས་ཐམས་ཅད་དང་མཉམ་པ་ཉིད་ཐོབ་པར་བགྱི་བ་དང་། སངས་རྒྱས་ཐམས་ཅད་ཀྱི་སྨོན་ལམ་ཁོང་དུ་ཆུད་པར་བགྱི་བ་དང་། སངས་རྒྱས་ཐམས་ཅད་ཀྱི་སྨོན་ལམ་ཡོངས་སུ་རྫོགས་པར་བགྱི་བ་དང་། སངས་རྒྱས་ཐམས་ཅད་ཀྱི་ཡང་དག་པར་བསྒྲུབ་པའི་ཡེ་ཤེས་སྣང་བར་བགྱི་བ་དང་། སངས་རྒྱས་ཐམས་ཅད་རང་གི་ལུས་སུ་མངོན་པར་བསྒྲུབ་པ་དང་། སངས་རྒྱས་ཐམས་ཅད་ཀྱིས་ཡང་དག་པར་བསྒྲུབས་པ་རང་གི་སྤྱོད་པ་མངོན་པར་བསྒྲུབ་པར་བགྱི་བ་དང་། སངས་རྒྱས་ཐམས་ཅད་ཀྱི་རྣམ་པར་འཕྲུལ་པ་མངོན་སུམ་དུ་རྟོགས་པར་བགྱི་བ་དང་། སངས་རྒྱས་ཐམས་ཅད་ཀྱི་སྟོབས་དང་མི་བསྙེངས་པ་ཡོངས་སུ་དག་པར་བགྱི་བ་དང་། སངས་རྒྱས་ཐམས་ཅད་ཀྱི་ཆོས་བསྟན་པ་མཉན་པས་མི་ངོམས་པར་བགྱི་བ་དང་། སངས་རྒྱས་ཐམས་ཅད་ཀྱི་ཆོས་བསྟན་པ་མཉན་ཅིང་བླང་བར་བགྱི་བ་དང་། སངས་རྒྱས་ཐམས་ཅད་ཀྱི་ཆོས་བསྟན་པ་ཡང་དག་པར་གཟུང་བར་བགྱི་བ་དང་། སངས་རྒྱས་ཐམས་ཅད་ཀྱི་ཆོས་བསྟན་པ་རྣམ་པར་དབྱེ་བར་བགྱི་བ་དང་། སངས་རྒྱས་ཐམས་ཅད་ཀྱི་ཆོས་བསྟན་པ་ཡོངས་སུ་གཟུང་བ་དང་། བྱང་ཆུབ་སེམས་དཔའ་ཐམས་ཅད་དང་། ཚུལ་གཅིག་ཏུ་འགྱུར་བར་བགྱི་བ་དང་། བྱང་ཆུབ་སེམས་དཔའ་ཐམས་ཅད་དང་སྐལ་བ་མཉམ་པར་བགྱི་བ་དང་། བྱང་ཆུབ་སེམས་དཔའ་ཐམས་ཅད་ཀྱི་སྤྱོད་པ་ཡོངས་སུ་དག་པར་བགྱི་བ་དང་། བྱང་ཆུབ་སེམས་དཔའ་ཐམས་ཅད་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ཡོངས་སུ་རྫོགས་པར་བགྱི་བ་དང་། བྱང་ཆུབ་སེམས་དཔའ་ཐམས་ཅད་ཀྱི་སྨོན་ལམ་མངོན་པར་བསྒྲུབ་པ་རྣམ་པར་དག་པར་བགྱི་བ་དང་བྱང་ཆུབ་སེམས་དཔའ་ཐམས་ཅད་ཀྱི་སངས་རྒྱས་ཀྱི་བྱིན་གྱི་རླབས་ཀྱི་མཛོད་རབ་ཏུ་ཐོབ་པར་བགྱི་བ་དང་། བྱང་ཆུབ་སེམས་དཔའ་ཐམས་ཅད་ཀྱི་ཆོས་ཀྱི་གཏེར་དང་མཛོད་མི་ཟད་པའི་ཡེ་ཤེས་སྣང་བ་ཐོབ་པར་བགྱི་བ་དང་། བྱང་ཆུབ་སེམས་དཔའ་ཐམས་ཅད་ཀྱི་ཏིང་ངེ་འཛིན་གྱི་གཏེར་དང་མཛོད་ཁོང་དུ་ཆུད་པར་བགྱི་བ་དང་། བྱང་ཆུབ་སེམས་དཔའ་ཐམས་ཅད་ཀྱི་མཛོད་ཚད་མེད་པ་མངོན་པར་བསྒྲུབ་པ་དང་། བྱང་ཆུབ་སེམས་དཔའ་ཐམས་ཅད་ཀྱི་སྙིང་རྗེ་ཆེན་པོའི་གཏེར་དང་མཛོད་སེམས་ཅན་འདུལ་བའི་མཐར་ཕྱིན་པར་བགྱི་བ་དང་། བྱང་ཆུབ་སེམས་དཔའ་ཐམས་ཅད་ཀྱི་རྣམ་པར་འཕྲུལ་བའི་གཏེར་དང་མཛོད་རྣམ་པར་དམིགས་པར་བགྱི་བ་དང་། བྱང་ཆུབ་སེམས་དཔའ་ཐམས་ཅད་ཀྱི་དབང་གི་གཏེར་དང་། མཛོད་རང་གི་སེམས་ཀྱིས་དབང་དུ་བགྱི་བ་དང་། བྱང་ཆུབ་སེམས་དཔའ་ཐམས་ཅད་ཀྱི་རྣམ་པར་དག་པའི་གཏེར་དང་། མཛོད་རྣམ་པ་ཐམས་ཅད་དུ་བརྒྱན་པར་བགྱི་བའི་སླད་དུ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་སེམས་བསྐྱེད་ནས། འཕགས་པ་དེ་ལྟ་བུའི་སེམས་ཀྱིས་བདག་འདིར་མཆིས་སོ། །བསམ་པ་དེ་ལྟ་བུ་དང་ཡིད་ལ་སྨོན་པ་དེ་ལྟ་བུ་དང་། མངོན་པར་དགའ་བ་དེ་ལྟ་བུ་དང་། སེམས་པ་དེ་ལྟ་བུ་དང་། གདོན་མི་འཚལ་བར་བསྒྲུབ་པར་བསམ་པ་དེ་ལྟ་བུ་དང་། །སྤྱོད་ཡུལ་མངོན་དུ་བགྱི་བ་དེ་ལྟ་བུ་དང་། ཚུལ་ཁོང་དུ་ཆུད་པར་བགྱི་བ་ལ་མོས་པ་དེ་ལྟ་བུ་དང་། རྣམ་པར་དག་པ་ལ་གཞོལ་བ་དེ་ལྟ་བུ་དང་། རྣམ་པར་དཔྱོད་པའི་བསམ་པ་དེ་ལྟ་བུ་དང་། རབ་ཏུ་གཞོལ་བའི་སེམས་དེ་ལྟ་བུ་དང་། དགེ་བའི་སྦྱོར་བ་དེ་ལྟ་བུ་དང་། མངོན་དུ་འགྱུར་བའི་དབང་པོ་དེ་ལྟ་བུས་བདག་འདིར་མཆིས་ཏེ། འཕགས་པ་ནི་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ལ་གདམས་ངག་དང་། རྗེས་སུ་སྟོན་པ་མཛད་ཅིང་ཚུལ་ནི་ཉེ་བར་སྟོན་པ་མཛད། རྟོགས་པར་བགྱི་བ་ནི་སྣང་བར་མཛད། ལམ་ནི་བསྟན་པར་མཛད། མུ་སྟེགས་ལ་ནི་འཇོག་པར་མཛད། ཆོས་ཀྱི་སྒོ་ནི་རྣམ་པར་འབྱེད་པ་མཛད། ཐེ་ཙོམ་ནི་ཡོངས་སུ་གཅོད་པར་མཛད། ནེམ་ནུར་ནི་སེལ་བར་མཛད།
en: to venerate all the buddhas; to see all the buddhas; to perceive all the buddhas; to comprehend the equality of all the buddhas; to comprehend the prayers of all the buddhas;

source: ཡིད་གཉིས་ཀྱི་ཟུག་རྔུ་ནི་འབྱིན་པར་མཛད། དོགས་པའི་དྲི་མ་ནི་སྦྱོང་བར་མཛད།
en: to fulfill the prayers of all the buddhas;

source: སེམས་ཀྱི་ཐིབས་པོ་ནི་སྣང་བར་མཛད།
en: to have the light of the wisdom accomplished by all the buddhas;

source: སེམས་ཀྱི་དྲི་མ་ནི་ཡོངས་སུ་སེལ་བར་མཛད།
en: to accomplish all buddhas within my own body;

source: སེམས་ཀྱི་རྒྱུད་ནི་རབ་ཏུ་དང་བར་མཛད།
en: to accomplish the knowledge of all the buddhas in my own conduct;

source: སེམས་ཀྱི་གཡོ་སྒྱུ་ནི་ཡོངས་སུ་སེལ་བར་མཛད།
en: to have the direct perception of the miracles of all the buddhas;

source: སེམས་ཀྱི་གདུང་བ་ནི་ཡོངས་སུ་སིམ་པར་མཛད།
en: to purify the strengths and fearlessnesses of all the buddhas; to never have enough of hearing the Dharma that is taught by all the buddhas;

source: འཁོར་བ་ལས་ནི་སེམས་རྣམ་པར་བཟློག་པར་མཛད།
en: to hear and adopt the Dharma that is taught by all the buddhas;

source: མི་དགེ་བའི་ལས་ནི་ཕྱིར་བཟློག་པར་མཛད།
en: to truly hold the Dharma that is taught by all the buddhas;

source: སེམས་ཅན་དམྱལ་བ་ལས་ནི་ལྡོག་པར་མཛད། གནས་དང་ནི་དབྲལ་བར་མཛད། མངོན་པར་ཞེན་པ་ལས་ནི་གྱེན་དུ་བསྐྱོད་པ་མཛད།
en: to become the same as all the bodhisattvas; to be included among the bodhisattvas;
